% 读取DICOM图像
I = dicomread('E:\医学图像处理\series-000006\image-000006.dcm');

% 优化对比度增强参数
G = imadjust(I, [0.05, 0.6], [0, 1]);%输出图像 = imadjust(输入图像, [输入灰度下限, 输入灰度上限], [输出灰度下限, 输出灰度上限])；
% 归一化到0~1之间；提取输入图像中0.05-0.6灰度区间的内容，并将其反转显示

% 显示四张图
figure('Name', '医学图像增强对比');

% 第1张：原始图像
subplot(2,2,1);
imshow(I, []);  % 用[]自动适配灰度范围显示，避免原始图过暗
title('原始医学影像');

% 第2张：原始图像直方图
subplot(2,2,2);
imhist(I);
title('原始图像直方图');

% 第3张：增强后图像
subplot(2,2,3);
imshow(G, []);  % 同样自动适配显示
title('对比度增强后图像');

% 第4张：增强后直方图
subplot(2,2,4);
imhist(G);
title('增强后直方图');

